cmsis-svd/cmsis-svd/data/NXP/LPC11Axx.svd
				<register>
					<name>EMR</name>
					<description>External Match Register. The EMR controls the match function and the external match pins </description>
					<addressOffset>0x03C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EM0</name>
							<description>External Match 0. This bit reflects the state of output CT16B0_MAT0/CT16B1_MAT0, whether or not this output is connected to its pin. When a match occurs between the TC and MR0, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[5:4] control the functionality of this output. This bit is driven to the CT16B0_MAT0/CT16B1_MAT0 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>EM1</name>
							<description>External Match 1. This bit reflects the state of output CT16B0_MAT1/CT16B1_MAT1, whether or not this output is connected to its pin. When a match occurs between the TC and MR1, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[7:6] control the functionality of this output. This bit is driven to the CT16B0_MAT0/CT16B1_MAT0 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>EM2</name>
							<description>External Match 2. This bit reflects the state of match channel 2. When a match occurs between the TC and MR2, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[9:8] control the functionality of this output.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>EM3</name>
							<description>External Match 3. This bit reflects the state of output of match channel 3. When a match occurs between the TC and MR3, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[11:10] control the functionality of this output.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>EMC0</name>
							<description>External Match Control 0. Determines the functionality of External Match 0. Table 238 shows the encoding of these bits.</description>
							<bitRange>[5:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING_</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_THE_CORRESPOND</name>
									<description>Clear the corresponding External Match bit/output to 0 (CT16Bi_MAT0 pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_THE_CORRESPONDIN</name>
									<description>Set the corresponding External Match bit/output to 1 (CT16Bi_MAT0 pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_THE_CORRESPON</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC1</name>
							<description>External Match Control 1. Determines the functionality of External Match 1.</description>
							<bitRange>[7:6]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING_</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_THE_CORRESPOND</name>
									<description>Clear the corresponding External Match bit/output to 0 (CT16Bi_MAT1 pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_THE_CORRESPONDIN</name>
									<description>Set the corresponding External Match bit/output to 1 (CT16Bi_MAT1 pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_THE_CORRESPON</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC2</name>
							<description>External Match Control 2. Determines the functionality of External Match 2.</description>
							<bitRange>[9:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING_</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_THE_CORRESPOND</name>
									<description>Clear the corresponding External Match bit/output to 0 (CT16Bi_MAT2 pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_THE_CORRESPONDIN</name>
									<description>Set the corresponding External Match bit/output to 1 (CT16Bi_MAT2 pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_THE_CORRESPON</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMC3</name>
							<description>External Match Control 3. Determines the functionality of External Match 3. Table 238 shows the encoding of these bits.</description>
							<bitRange>[11:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DO_NOTHING_</name>
									<description>Do Nothing.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_THE_CORRESPOND</name>
									<description>Clear the corresponding External Match bit/output to 0 (CT16Bi_MAT3 pin is LOW if pinned out).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_THE_CORRESPONDIN</name>
									<description>Set the corresponding External Match bit/output to 1 (CT16Bi_MAT3 pin is HIGH if pinned out).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TOGGLE_THE_CORRESPON</name>
									<description>Toggle the corresponding External Match bit/output.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:12]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CTCR</name>
					<description>Count Control Register. The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>
					<addressOffset>0x070</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CTM</name>
							<description>Counter/Timer Mode. This field selects which rising PCLK edges can increment Timer's Prescale Counter (PC), or clear PC and increment Timer Counter (TC). If Counter mode is selected in the CTCR, bits 2:0 in the Capture Control Register (CCR) must be programmed as 000.</description>
							<bitRange>[1:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>TIMER_MODE_EVERY_RI</name>
									<description>Timer Mode: every rising PCLK edge</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RISING_EDGE</name>
									<description>Counter Mode: TC is incremented on rising edges on the CAP input selected by bits 3:2.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING_EDGE</name>
									<description>Counter Mode: TC is incremented on falling edges on the CAP input selected by bits 3:2.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BOTH_EDGES</name>
									<description>Counter Mode: TC is incremented on both edges on the CAP input selected by bits 3:2.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CIS</name>
							<description>Count Input Select. In counter mode (when bits 1:0 in this register are not 00), these bits select which CAP pin or comparator output is sampled for clocking. Values 0x1 to 0x3 are reserved.</description>
							<bitRange>[3:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>CT16BN_CAP0</name>
									<description>CT16Bn_CAP0</description>
									<value>0x0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENCC</name>
							<description>Setting this bit to 1 enables clearing of the timer and the prescaler when the capture-edge event specified in bits 7:5 occurs.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>SELCC</name>
							<description>When bit 4 is a 1, these bits select which capture input edge will cause the timer and prescaler to be cleared. These bits have no effect when bit 4 is low. Values 0x2 to 0x7 are reserved.</description>
							<bitRange>[7:5]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>RISING_EDGE_OF_CAP0_</name>
									<description>Rising Edge of CAP0 clears the timer (if bit 4 is set)</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>FALLING_EDGE_OF_CAP0</name>
									<description>Falling Edge of CAP0 clears the timer (if bit 4 is set)</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:8]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PWMC</name>
					<description>PWM Control Register. The PWMCON enables PWM mode for the external match pins CT16B0_MAT[1:0] and CT16B1_MAT[1:0].</description>
					<addressOffset>0x074</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PWMEN0</name>
							<description>PWM mode enable for channel0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EM0</name>
									<description>CT16Bi_MAT0 is controlled by EM0.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM_MODE_IS_ENABLED_</name>
									<description>PWM mode is enabled for CT16Bi_MAT0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMEN1</name>
							<description>PWM mode enable for channel1.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EM1</name>
									<description>CT16Bi_MAT01 is controlled by EM1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM_MODE_IS_ENABLED_</name>
									<description>PWM mode is enabled for CT16Bi_MAT1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMEN2</name>
							<description>PWM mode enable for channel2.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EM2</name>
									<description>CT16Bi_MAT2 is controlled by EM2.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM_MODE_IS_ENABLED_</name>
									<description>PWM mode is enabled for CT16Bi_MAT2.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMEN3</name>
							<description>PWM mode enable for channel3.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EM3</name>
									<description>CT16Bi_MAT3 is controlled by EM3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PWM_MODE_IS_ENABLED_</name>
									<description>PWM mode is enabled for CT16Bi_MAT3.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
							<bitRange>[31:4]</bitRange>
						</field>
					</fields>
				</register>
