cmsis-svd/cmsis-svd/data/NXP/LPC11Axx.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="CT32B0">
			<name>CT32B1</name>
			<baseAddress>0x40018000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CT32B1</name>
				<value>19</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>ADC</name>
			<description>ADC </description>
			<groupName>ADC</groupName>
			<baseAddress>0x4001C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC</name>
				<value>24</value>
			</interrupt>
			<registers>
	<register>
		<name>CR</name>
		<description>A/D Control Register. The CR register must be written to select the operating mode before A/D conversion can occur.</description>
		<addressOffset>0x000</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>SEL</name>
				<description>Selects which of the AD7:0 pins is (are) to be sampled and converted. Bit 0 selects Pin AD0, bit 1 selects pin AD1,..., and bit 7 selects pin AD7.  In software-controlled mode (BURST = 0), only one channel can be selected, i.e. only one of these bits should be 1.  In hardware scan mode (BURST = 1), any numbers of channels can be selected, i.e any or all bits can be set to 1. If all bits are 0 (as after Reset) channel 0 is selected automatically.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>CLKDIV</name>
				<description>The APB clock (PCLK) is divided by CLKDIV +1 to produce the clock for the ADC, which should be less than or equal to 4.5 MHz. Typically, software should program the smallest value in this field that yields a clock of 4.5 MHz or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable.</description>
				<bitRange>[15:8]</bitRange>
			</field>
			<field>
				<name>BURST</name>
				<description>Burst mode</description>
				<bitRange>[16:16]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>SOFTWARE_CONTROLLED_</name>
						<description>Software-controlled mode: Conversions are software-controlled and require 11 clocks.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>HARDWARE_SCAN_MODE_</name>
						<description>Hardware scan mode: The AD converter does repeated conversions at the rate selected by the CLKS field, scanning (if necessary) through the pins selected by 1s in the SEL field. The first conversion after the start corresponds to the least-significant bit set to 1 in the SEL field, then the next higher  bits (pins) set to 1 are scanned if applicable. Repeated conversions can be terminated by clearing this bit, but the conversion in progress when this bit is cleared will be completed. If bit 20 in this register is set (single-burst mode), hardware clears this bit automatically after one set of conversions on all of the selected channels.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>CLKS</name>
				<description>This field selects the number of clocks used for each conversion in Burst mode, and the number of bits of accuracy of the result in the LS bits of ADDR, between 11 clocks (10 bits) and 4 clocks (3 bits).</description>
				<bitRange>[19:17]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>11_CLOCKS</name>
						<description>11 clocks / 10 bits</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>10_CLOCKS</name>
						<description>10 clocks / 9 bits</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>9_CLOCKS</name>
						<description>9 clocks / 8 bits</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>8_CLOCKS</name>
						<description>8 clocks / 7 bits</description>
						<value>0x3</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>7_CLOCKS</name>
						<description>7 clocks / 6 bits</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>6_CLOCK</name>
						<description>6 clocks / 5 bits</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>5_CLOCKS</name>
						<description>5 clocks / 4 bits</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>4_CLOCKS</name>
						<description>4 clocks / 3 bits</description>
						<value>0x7</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>SINGLEBURST</name>
				<description>Single-burst mode</description>
				<bitRange>[20:20]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>CONTINUOUS_BURST</name>
						<description>Continuous. Burst mode can only be terminated via a software write to clear bit 16 in this register.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>SINGLE_BURST</name>
						<description>Single-burst. When the burst mode is selected by writing a 1 to bit 16 in this register, the ADC cycles through a single set of conversions on the selection of channels specified in the SEL field. Once the conversion has been completed on each selected channel, bit 16 is automatically cleared and the conversions stop until a new trigger event occurs.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[22:21]</bitRange>
			</field>
			<field>
				<name>START</name>
				<description>When the BURST bit is 0, these bits control whether/when an A/D conversion is started. All other values are reserved.</description>
				<bitRange>[26:23]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>NO_START_THIS_VALUE</name>
						<description>No start (this value should be used when clearing PDN to 0).</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>START_CONVERSION_NOW</name>
						<description>Start conversion now.</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>START_CONVERSION_WHE</name>
						<description>Start conversion when the edge selected by bit 27 occurs on ATRG0.</description>
						<value>0x4</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>START_CONVERSION_WHE</name>
						<description>Start conversion when the edge selected by bit 27 occurs on the analog comparator output.</description>
						<value>0x5</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>START_CONVERSION_WHE</name>
						<description>Start conversion when the edge selected by bit 27 occurs on ATRG1.</description>
						<value>0x6</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>START_CONVERSION_WHE</name>
						<description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT0[1].</description>
						<value>0x8</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>START_CONVERSION_WHE</name>
						<description>Start conversion when the edge selected by bit 27 occurs on CT32B0_MAT1[1].</description>
						<value>0xA</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>START_CONVERSION_WHE</name>
						<description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT0[1].</description>
						<value>0xC</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>START_CONVERSION_WHE</name>
						<description>Start conversion when the edge selected by bit 27 occurs on CT16B0_MAT1[1].</description>
						<value>0xE</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>EDGE</name>
				<description>This bit is significant only when the START field contains 0100-1110. In these cases:</description>
				<bitRange>[27:27]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>START_CONVERSION_ON_</name>
						<description>Start conversion on a rising edge on the selected signal.</description>
						<value>0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>START_CONVERSION_ON_</name>
						<description>Start conversion on a falling edge on the selected signal.</description>
						<value>1</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
				<bitRange>[31:28]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>GDR</name>
		<description>A/D Global Data Register. Contains the result of the most recent A/D conversion.</description>
		<addressOffset>0x004</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved. These bits always read as zeroes.</description>
				<bitRange>[5:0]</bitRange>
			</field>
			<field>
				<name>V_VREF</name>
				<description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin selected by the SEL field, divided by the voltage on the VDD pin. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VSS, while 0x3FF indicates that the voltage on ADn was close to, equal to, or greater than that on VREF.</description>
				<bitRange>[15:6]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. These bits always read as zeroes. They allow accumulation of successive A/D values without AND-masking, for at least 256 values without overflow into the CHN field.</description>
				<bitRange>[23:16]</bitRange>
			</field>
			<field>
				<name>CHN</name>
				<description>These bits contain the channel from which the LS bits were converted.</description>
				<bitRange>[26:24]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. These bits always read as zeroes.</description>
				<bitRange>[29:27]</bitRange>
			</field>
			<field>
				<name>OVERRUN</name>
				<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the LS bits. In non-FIFO operation, this bit is cleared by reading this register.</description>
				<bitRange>[30:30]</bitRange>
			</field>
			<field>
				<name>DONE</name>
				<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read and when the ADCR is written. If the ADCR is written while a conversion is still in progress, this bit is set and a new conversion is started.</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>SEL</name>
		<description>A/D Select Register. Selects between external pins and internal sources.</description>
		<addressOffset>0x008</addressOffset>
		<access>read-write</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Always write zeroes to these bits.</description>
				<bitRange>[9:0]</bitRange>
			</field>
			<field>
				<name>AD5SEL</name>
				<description>This field selects the source signal for channel 5.</description>
				<bitRange>[11:10]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>AD5_PIN</name>
						<description>AD5 pin</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NO_CONNECTION_OR_LOA</name>
						<description>No connection or load</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>CORE_VOLTAGE_REGULAT</name>
						<description>Core voltage regulator output (1.2 to 1.8V)</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED_DO_NOT_PRO</name>
						<description>Reserved. Do not program this value.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>AD6SEL</name>
				<description>This field selects the source signal for channel 6.</description>
				<bitRange>[13:12]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>AD6_PIN</name>
						<description>AD6 pin</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NO_CONNECTION_OR_LOA</name>
						<description>No connection or load</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>INTERNAL_VOLTAGE_REF</name>
						<description>Internal voltage reference</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED_DO_NOT_PRO</name>
						<description>Reserved. Do not program this value.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>AD7SEL</name>
				<description>This field selects the source signal for channel 7.</description>
				<bitRange>[15:14]</bitRange>
				<enumeratedValues>
				<name>ENUM</name>
					<enumeratedValue>
						<name>AD7_PIN</name>
						<description>AD7 pin</description>
						<value>0x0</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>NO_CONNECTION_OR_LOA</name>
						<description>No connection or load</description>
						<value>0x1</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>TEMPERATURE_SENSOR</name>
						<description>Temperature sensor</description>
						<value>0x2</value>
					</enumeratedValue>
					<enumeratedValue>
						<name>RESERVED_DO_NOT_PRO</name>
						<description>Reserved. Do not program this value.</description>
						<value>0x3</value>
					</enumeratedValue>
				</enumeratedValues>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Always write zeroes to these bits.</description>
				<bitRange>[31:16]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>STAT</name>
		<description>A/D Status Register. This register contains DONE and OVERRUN flags for all of the A/D channels, as well as the A/D interrupt flag.</description>
		<addressOffset>0x030</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>DONE</name>
				<description>These bits mirror the DONE status flags that appear in the result register for each A/D channel.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>OVERRUN</name>
				<description>These bits mirror the OVERRUN status flags that appear in the result register for each A/D channel. Reading ADSTAT allows checking the status of all A/D channels simultaneously.</description>
				<bitRange>[15:8]</bitRange>
			</field>
			<field>
				<name>ADINT</name>
				<description>This bit is the A/D interrupt flag. It is one when any of the individual A/D channel Done flags is asserted and enabled to contribute to the A/D interrupt via the ADINTEN register.</description>
				<bitRange>[16:16]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Always 0.</description>
				<bitRange>[31:17]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<name>INTEN</name>
		<description>A/D Interrupt Enable Register. This register contains enable bits that allow the DONE flag of each A/D channel to be included or excluded from contributing to the generation of an A/D interrupt.</description>
		<addressOffset>0x00C</addressOffset>
		<access>read-write</access>
		<resetValue>0x00000100</resetValue>
		<resetMask>0xFFFFFFFF</resetMask>
		<fields>
			<field>
				<name>ADINTEN</name>
				<description>These bits allow control over which A/D channels generate interrupts for conversion completion. When bit 0 is one, completion of a conversion on A/D channel 0 will generate an interrupt, when bit 1 is one, completion of a conversion on A/D channel 1 will generate an interrupt, etc.</description>
				<bitRange>[7:0]</bitRange>
			</field>
			<field>
				<name>ADGINTEN</name>
				<description>When 1, enables the global DONE flag in ADDR to generate an interrupt. When 0, only the individual A/D channels enabled by ADINTEN 7:0 will generate interrupts.</description>
				<bitRange>[8:8]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. Always 0.</description>
				<bitRange>[31:9]</bitRange>
			</field>
		</fields>
	</register>
	<register>
		<dim>8</dim>
		<dimIncrement>0x4</dimIncrement>
		<dimIndex>0-7</dimIndex>
		<name>DR%s</name>
		<description>A/D Channel 0 Data Register. This register contains the result of the most recent conversion completed on channel 0</description>
		<addressOffset>0x010</addressOffset>
		<access>read-only</access>
		<resetValue>0</resetValue>
		<resetMask>0x00000000</resetMask>
		<fields>
			<field>
				<name>RESERVED</name>
				<description>Reserved. These bits always read as zeroes.</description>
				<bitRange>[5:0]</bitRange>
			</field>
			<field>
				<name>V_VREF</name>
				<description>When DONE is 1, this field contains a binary fraction representing the voltage on the ADn pin, divided by the voltage on the VREF pin. Zero in the field indicates that the voltage on the ADn pin was less than, equal to, or close to that on VREF, while 0x3FF indicates that the voltage on AD input was close to, equal to, or greater than that on VREF.</description>
				<bitRange>[15:6]</bitRange>
			</field>
			<field>
				<name>RESERVED</name>
				<description>Reserved. These bits always read as zeroes. They allow accumulation of successive A/D values without AND-masking for at least 256 values without overflow into the CHN field.</description>
				<bitRange>[29:16]</bitRange>
			</field>
			<field>
				<name>OVERRUN</name>
				<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the LS bits.This bit is cleared by reading this register.</description>
				<bitRange>[30:30]</bitRange>
			</field>
			<field>
				<name>DONE</name>
				<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
				<bitRange>[31:31]</bitRange>
			</field>
		</fields>
	</register>
