cmsis-svd/cmsis-svd/data/NXP/LPC11Axx.svd
			</registers>
		</peripheral>
		<peripheral>
        <name>CMP</name>
        <description>Comparator</description>
        <groupName>Comparator</groupName>
        <baseAddress>0x40028000</baseAddress>
		<addressBlock>
			<offset>0x0</offset>
			<size>0x1000</size>
			<usage>registers</usage>
		</addressBlock>
			<interrupt>
				<name>CMP</name>
				<value>10</value>
			</interrupt>
		<registers>
			<register>
				<name>CTL</name>
				<description>Comparator control register</description>
				<addressOffset>0x000</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as 0.</description>
						<bitRange>[2:0]</bitRange>
					</field>
					<field>
						<name>EDGESEL</name>
						<description>This field controls which edges on the comparator output set the COMPEDGE bit (bit 23 below): 00 = Falling edges 01 = Rising edges 1x = Both edges</description>
						<bitRange>[4:3]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>FALLING</name>
								<description>Falling edges</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>RISING</name>
								<description>Rising edges</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>DUALEDGE</name>
								<description>Both edges</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>DUALEDGE</name>
								<description>Both edges</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as 0.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>COMPSA</name>
						<description>Comarator output control</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>DIRECT</name>
								<description>Uses the comparator output directly.</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>SYNCH</name>
								<description>Synchronizes the comparator output to the bus clock for output to other modules.</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as 0.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>COMP_VP_SEL</name>
						<description>Selects positive voltage input</description>
						<bitRange>[10:8]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>VLADOUT</name>
								<description>voltage ladder output</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMPI1</name>
								<description>ACMPI1</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMPI2</name>
								<description>ACMPI2</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMPI3</name>
								<description>ACMPI3</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMPI4</name>
								<description>ACMPI4</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMPI5</name>
								<description>ACMPI5</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>INTVOLTAGEREF</name>
								<description>internal reference voltage</description>
								<value>0x6</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>TEMPSENSOR</name>
								<description>temperature sensor</description>
								<value>0x7</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>COMP_VM_SEL</name>
						<description>Selects negative voltage input</description>
						<bitRange>[13:11]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>VLADDOUT</name>
								<description>voltage ladder output</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMPI1</name>
								<description>ACMPI1</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMPI2</name>
								<description>ACMPI2</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMPI3</name>
								<description>ACMPI3</description>
								<value>0x3</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMPI4</name>
								<description>ACMPI4</description>
								<value>0x4</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>ACMPI5</name>
								<description>ACMPI5</description>
								<value>0x5</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>INTVOLTAGEREF</name>
								<description>internal reference voltage</description>
								<value>0x6</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as 0.</description>
						<bitRange>[19:14]</bitRange>
					</field>
					<field>
						<name>EDGECLR</name>
						<description>Interrupt clear bit. Writing a 1 to this bit clears the COMPEDGE bit (bit 23 below) and thus negates the interrupt request.</description>
						<bitRange>[20:20]</bitRange>
					</field>
					<field>
						<name>COMPSTAT</name>
						<description>Comparator status. This bit reflects the state of the comparator output.</description>
						<bitRange>[21:21]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as 0.</description>
						<bitRange>[22:22]</bitRange>
					</field>
					<field>
						<name>COMPEDGE</name>
						<description>Comparator edge-detect status.</description>
						<bitRange>[23:23]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Write as 0.</description>
						<bitRange>[24:24]</bitRange>
					</field>
					<field>
						<name>HYS</name>
						<description>Controls the hysteresis of the comparator. When the comparator is outputting a certain state, this is the difference between the selected signals, in the opposite direction from the state being output, that will switch the output.</description>
						<bitRange>[26:25]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>NOHYSTERESIS</name>
								<description>None (the output will switch as the voltages cross)</description>
								<value>0x0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>HYS5MV</name>
								<description>5 mV</description>
								<value>0x1</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>HSY10MV</name>
								<description>10 mV</description>
								<value>0x2</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>HSY20MV</name>
								<description>20 mV</description>
								<value>0x3</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved</description>
						<bitRange>[31:27]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>LAD</name>
				<description>Voltage ladder register</description>
				<addressOffset>0x004</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>LADEN</name>
						<description>Voltage ladder enable</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>LADSEL</name>
						<description>Voltage ladder value. The reference voltage Vref depends on the LADREF bit below. 00000 = VSS 00001 = 1  Vref/31 00010 = 2  Vref/31 ... 11111 = Vref</description>
						<bitRange>[5:1]</bitRange>
					</field>
					<field>
						<name>LADREF</name>
						<description>Selects the reference voltage for the voltage ladder</description>
						<bitRange>[6:6]</bitRange>
						<enumeratedValues>
						<name>ENUM</name>
							<enumeratedValue>
								<name>VDDPIN</name>
								<description>VDD pin</description>
								<value>0</value>
							</enumeratedValue>
							<enumeratedValue>
								<name>VDDCMPPIN</name>
								<description>VDDCMP pin</description>
								<value>1</value>
							</enumeratedValue>
						</enumeratedValues>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Unused</description>
						<bitRange>[31:7]</bitRange>
					</field>
				</fields>
			</register>
