cmsis-svd/cmsis-svd/data/NXP/LPC11Axx.svd
   <register>
      <name>PIO0_19</name>
      <description>I/O configuration register for pin PIO0_19/CLKIN/ CLKOUT/ MOSI0/CT16B1_MAT0</description>
      <addressOffset>0x4C</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000090</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin PIO0_19/CLKIN/ CLKOUT/ MOSI0/CT16B1_MAT0</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>PIO0_19</name>
                  <description>General purpose digital input/output pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CLKIN</name>
                  <description>External clock input.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CLKOUT</name>
                  <description>Clock output.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>MOSI0</name>
                  <description>Master Out Slave In for SSP0.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT16B1_MAT0</name>
                  <description>Match output 0 for 16-bit timer 1.</description>
                  <value>0x4</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>SLOW</name>
                  <description>Slow. More outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>PIO0_20</name>
      <description>I/O configuration register for pin PIO0_20/R/SCK0/ CT32B1_CAP0/ CT16B1_MAT2</description>
      <addressOffset>0x50</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000090</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin PIO0_20/R/SCK0/ CT32B1_CAP0/ CT16B1_MAT2</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>PIO0_20</name>
                  <description>General purpose digital input/output pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>R</name>
                  <description>Reserved.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SCK0</name>
                  <description>Serial clock for SSP0.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT32B1_CAP0</name>
                  <description>Capture input 0 for 32-bit timer 1.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT16B1_MAT2</name>
                  <description>Match output 2 for 16-bit timer 1.</description>
                  <value>0x4</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>SLOW</name>
                  <description>Slow. More outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>PIO0_21</name>
      <description>I/O configuration register for pin PIO0_21/CTS/ ACMP_O/ CT32B1_CAP1/SCLK</description>
      <addressOffset>0x54</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000090</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin PIO0_21/CTS/ ACMP_O/ CT32B1_CAP1/SCLK</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>PIO0_21</name>
                  <description>General purpose digital input/output pin. If configured
                                    as output, this pin is a high-current source output driver (20
                                    mA).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CTS</name>
                  <description>Clear To Send input for USART.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ACMP_O</name>
                  <description>Analog comparator output.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CT32B1_CAP1</name>
                  <description>Capture input 1 for 32-bit timer 1.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SCLK</name>
                  <description>Serial clock for USART.</description>
                  <value>0x4</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>SLOW</name>
                  <description>Slow. More outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
