cmsis-svd/cmsis-svd/data/NXP/LPC11Axx.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="GPIO_GROUP_INT0">
			<name>GPIO_GROUP_INT1</name>
			<baseAddress>0x40060000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GINT1</name>
				<value>9</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>GPIO_PORT</name>
			<description>GPIO port </description>
			<groupName>GPIO_PORT</groupName>
			<baseAddress>0x50000000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
	<!--			<register>  this occupies the same address space as B0 and B1 but causes an error in svdconv
					<dim>64</dim>
					<dimIncrement>0x1</dimIncrement>
					<dimIndex>0-63</dimIndex>
					<name>B%s</name>
					<description>Byte pin registers port 0; pins PIO0_0 to PIO0_31</description>
					<addressOffset>0x0000</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PBYTE</name>
							<description>Read: state of the pin P0_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
					</fields>
				</register>		-->
				<register>
					<dim>32</dim>
					<dimIncrement>0x1</dimIncrement>
					<dimIndex>0-31</dimIndex>
					<name>B%s</name>
					<description>Byte pin registers port 0; pins PIO0_0 to PIO0_31</description>
					<addressOffset>0x0000</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PBYTE</name>
							<description>Read: state of the pin P0_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>10</dim>
					<dimIncrement>0x1</dimIncrement>
					<dimIndex>32-41</dimIndex>
					<name>B%s</name>
					<description>Byte pin registers port 1</description>
					<addressOffset>0x0020</addressOffset>
					<size>8</size>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PBYTE</name>
							<description>Read: state of the pin P1_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. Write: loads the pin's output bit.</description>
							<bitRange>[0:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>32</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-31</dimIndex>
					<name>W%s</name>
					<description>Word pin registers port 0</description>
					<addressOffset>0x1000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PWORD</name>
							<description>Read 0: pin is LOW.  Write 0: clear output bit. Read 0xFFFF FFFF: pin is HIGH.  Write any value 0x0000 0001 to 0xFFFF FFFF: set output bit. Only 0 or 0xFFFF FFFF can be read. Writing any value other than 0 will set the output bit.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>10</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>32-41</dimIndex>
					<name>W%s</name>
					<description>Word pin registers port 1</description>
					<addressOffset>0x1080</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PWORD</name>
							<description>Read 0: pin is LOW.  Write 0: clear output bit. Read 0xFFFF FFFF: pin is HIGH.  Write any value 0x0000 0001 to 0xFFFF FFFF: set output bit. Only 0 or 0xFFFF FFFF can be read. Writing any value other than 0 will set the output bit.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>DIR%s</name>
					<description>Direction registers port 0/1</description>
					<addressOffset>0x2000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIRP0</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>DIRP1</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>DIRP2</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>DIRP3</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>DIRP4</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>DIRP5</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>DIRP6</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>DIRP7</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>DIRP8</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>DIRP9</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>DIRP10</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>DIRP11</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>DIRP12</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[12:12]</bitRange>
						</field>
						<field>
							<name>DIRP13</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[13:13]</bitRange>
						</field>
						<field>
							<name>DIRP14</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[14:14]</bitRange>
						</field>
						<field>
							<name>DIRP15</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>DIRP16</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[16:16]</bitRange>
						</field>
						<field>
							<name>DIRP17</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[17:17]</bitRange>
						</field>
						<field>
							<name>DIRP18</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[18:18]</bitRange>
						</field>
						<field>
							<name>DIRP19</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[19:19]</bitRange>
						</field>
						<field>
							<name>DIRP20</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[20:20]</bitRange>
						</field>
						<field>
							<name>DIRP21</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[21:21]</bitRange>
						</field>
						<field>
							<name>DIRP22</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[22:22]</bitRange>
						</field>
						<field>
							<name>DIRP23</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[23:23]</bitRange>
						</field>
						<field>
							<name>DIRP24</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[24:24]</bitRange>
						</field>
						<field>
							<name>DIRP25</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[25:25]</bitRange>
						</field>
						<field>
							<name>DIRP26</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[26:26]</bitRange>
						</field>
						<field>
							<name>DIRP27</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[27:27]</bitRange>
						</field>
						<field>
							<name>DIRP28</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[28:28]</bitRange>
						</field>
						<field>
							<name>DIRP29</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[29:29]</bitRange>
						</field>
						<field>
							<name>DIRP30</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[30:30]</bitRange>
						</field>
						<field>
							<name>DIRP31</name>
							<description>Selects pin direction for pin P0/1_n (bit 0 = P0/1_0, bit 1 = P0_1, ..., bit 31 = P0/1_31). 0 = input. 1 = output.</description>
							<bitRange>[31:31]</bitRange>
						</field>
					</fields>
				</register>
